In [1]:
from env import host, username, password
import matplotlib as plt 
import pandas as pd
import numpy as np

In [2]:
# Create a function named get_db_url. It should accept a username, hostname, password, and database name

In [3]:
def get_db_url(database):
    return f'mysql+pymysql://{username}:{password}@{host}/employees'

In [4]:
# Use your function to obtain a connection to the employees database.

In [5]:
query = '''
SELECT *
FROM employees
'''

In [6]:
df = pd.read_sql(query, get_db_url('employees'))

In [7]:
df.head()

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2   10003  1959-12-03      Parto   Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300024 entries, 0 to 300023
Data columns (total 6 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   emp_no      300024 non-null  int64
 1   birth_date  300024 non-null  object
 2   first_name  300024 non-null  object
 3   last_name   300024 non-null  object
 4   gender      300024 non-null  object
 5   hire_date   300024 non-null  object
dtypes: int64(1), object(5)
memory usage: 13.7+ MB

In [9]:
# Once you have successfully run a query: 
# a. Intentionally make a typo in the database url. What kind of error message do you see?
# b. Intentionally make an error in your SQL query. What does the error message look like?

In [10]:
df = pd.read_sql(query, get_db_url('truk'))

In [11]:
query = '''
SELECT !*>
FROM employees
'''

In [70]:
er_df = pd.read_sql(query, get_db_url('employees'))

In [12]:
# Read the employees and titles tables into two separate DataFrames.

In [71]:
employees = 'SELECT * FROM employees'
titles = 'SELECT * FROM titles'

In [72]:
employees_df = pd.read_sql(employees, get_db_url('employees'))
titles_df = pd.read_sql(titles, get_db_url('employees'))
employees_df.head

<bound method NDFrame.head of         emp_no  birth_date first_name last_name gender   hire_date
0        10001  1953-09-02     Georgi   Facello      M  1986-06-26
1        10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2        10003  1959-12-03      Parto   Bamford      M  1986-08-28
3        10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4        10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12
...        ...         ...        ...       ...    ...         ...
300019  499995  1958-09-24     Dekang  Lichtner      F  1993-01-12
300020  499996  1953-03-07       Zito      Baaz      M  1990-09-27
300021  499997  1961-08-03    Berhard    Lenart      M  1986-04-21
300022  499998  1956-09-05   Patricia   Breugel      M  1993-10-13
300023  499999  1958-05-01     Sachin   Tsukuda      M  1997-11-30

[300024 rows x 6 columns]>

In [15]:
titles_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 443308 entries, 0 to 443307
Data columns (total 4 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   emp_no     443308 non-null  int64
 1   title      443308 non-null  object
 2   from_date  443308 non-null  object
 3   to_date    443308 non-null  object
dtypes: int64(1), object(3)
memory usage: 13.5+ MB

In [16]:
# 7. How many rows and columns do you have in each DataFrame? Is that what you expected?

In [17]:
employees_df.shape

(300024, 6)

In [18]:
titles_df.shape

(443308, 4)

In [19]:
# 8. Display the summary statistics for each DataFrame.

In [20]:
employees_df.describe()

              emp_no
count  300024.000000
mean   253321.763392
std    161828.235540
min     10001.000000
25%     85006.750000
50%    249987.500000
75%    424993.250000
max    499999.000000

In [21]:
titles_df.describe()

              emp_no
count  443308.000000
mean   253075.034430
std    161853.292613
min     10001.000000
25%     84855.750000
50%    249847.500000
75%    424891.250000
max    499999.000000

In [22]:
# 9. How many unique titles are in the titles DataFrame?

In [23]:
titles_df['title'].value_counts()

Engineer              115003
Staff                 107391
Senior Engineer        97750
Senior Staff           92853
Technique Leader       15159
Assistant Engineer     15128
Manager                   24
Name: title, dtype: int64

In [24]:
titles_df['title'].nunique()

7

In [25]:
# 10. What is the oldest date in the to_date column?

In [26]:
titles_df['to_date'].min()

datetime.date(1985, 3, 1)

In [27]:
# 11. What is the most recent date in the to_date column?

In [28]:
query = '''
SELECT MAX(to_date) FROM titles
'''

In [29]:
# PART 2 EXERCISES

In [30]:
# Create the users DataFrame.

users = pd.DataFrame({
    'id': [1, 2, 3, 4, 5, 6],
    'name': ['bob', 'joe', 'sally', 'adam', 'jane', 'mike'],
    'role_id': [1, 2, 3, 3, np.nan, np.nan]
})
users

   id   name  role_id
0   1    bob      1.0
1   2    joe      2.0
2   3  sally      3.0
3   4   adam      3.0
4   5   jane      NaN
5   6   mike      NaN

In [31]:
# Create the roles DataFrame

roles = pd.DataFrame({
    'id': [1, 2, 3, 4],
    'name': ['admin', 'author', 'reviewer', 'commenter']
})
roles

   id       name
0   1      admin
1   2     author
2   3   reviewer
3   4  commenter

In [32]:
# Merge

In [33]:
(users.merge(roles, 
            left_on='role_id', 
            right_on='id', 
            how='outer')
    .drop(columns='role_id')
    .rename(columns={'id_x': 'id', 
                     'name_x': 'employee',
                     'id_y': 'role_id',
                     'name_y': 'role'}
            )
)

    id employee  role_id       role
0  1.0      bob      1.0      admin
1  2.0      joe      2.0     author
2  3.0    sally      3.0   reviewer
3  4.0     adam      3.0   reviewer
4  5.0     jane      NaN        NaN
5  6.0     mike      NaN        NaN
6  NaN      NaN      4.0  commenter

In [34]:
# What is the result of using a right join on the DataFrames?

In [35]:
users.merge(roles, left_on='role_id',right_on='id',how='right')

   id_x name_x  role_id  id_y     name_y
0   1.0    bob      1.0     1      admin
1   2.0    joe      2.0     2     author
2   3.0  sally      3.0     3   reviewer
3   4.0   adam      3.0     3   reviewer
4   NaN    NaN      NaN     4  commenter

In [36]:
# What is the result of using an outer join on the DataFrames?

In [37]:
users.merge(roles, left_on='role_id',right_on='id',how='outer')

   id_x name_x  role_id  id_y     name_y
0   1.0    bob      1.0   1.0      admin
1   2.0    joe      2.0   2.0     author
2   3.0  sally      3.0   3.0   reviewer
3   4.0   adam      3.0   3.0   reviewer
4   5.0   jane      NaN   NaN        NaN
5   6.0   mike      NaN   NaN        NaN
6   NaN    NaN      NaN   4.0  commenter

In [38]:
# What happens if you drop the foreign keys from the DataFrames and try to merge them?

In [39]:
pd.merge(users, roles,
        how='outer')

   id       name  role_id
0   1        bob      1.0
1   2        joe      2.0
2   3      sally      3.0
3   4       adam      3.0
4   5       jane      NaN
5   6       mike      NaN
6   1      admin      NaN
7   2     author      NaN
8   3   reviewer      NaN
9   4  commenter      NaN

In [40]:
# Load the mpg dataset from PyDataset.

In [41]:
from pydataset import data
mpg = data('mpg')
mpg.sample(5)

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class
77,ford,expedition 2wd,5.4,2008,8,auto(l6),r,12,18,r,suv
171,subaru,impreza awd,2.5,2008,4,auto(s4),4,20,27,r,compact
196,toyota,corolla,1.8,1999,4,manual(m5),f,26,35,r,compact
17,audi,a6 quattro,3.1,2008,6,auto(s6),4,17,25,p,midsize
131,land rover,range rover,4.0,1999,8,auto(l4),4,11,15,p,suv

In [42]:
# Output and read the documentation for the mpg dataset.

In [43]:
data('mpg', show_doc=True)

mpg

PyDataset Documentation (adopted from R Documentation. The displayed examples are in R)

## Fuel economy data from 1999 and 2008 for 38 popular models of car

### Description

This dataset contains a subset of the fuel economy data that the EPA makes
available on http://fueleconomy.gov. It contains only models which had a new
release every year between 1999 and 2008 - this was used as a proxy for the
popularity of the car.

### Usage

    data(mpg)

### Format

A data frame with 234 rows and 11 variables

### Details

  * manufacturer.

  * model.

  * displ. engine displacement, in litres

  * year.

  * cyl. number of cylinders

  * trans. type of transmission

  * drv. f = front-wheel drive, r = rear wheel drive, 4 = 4wd

  * cty. city miles per gallon

  * hwy. highway miles per gallon

  * fl.

  * class.

In [44]:
# How many rows and columns are in the dataset?

In [45]:
mpg.shape

(234, 11)

In [46]:
# Check out your column names and perform any cleanup you may want on them.

In [47]:
mpg = mpg.rename(columns={'hwy':'highway', 'cty':'city', 'displ':'displacement', 'cyl':'cylinders', 'drv': 'drive','fl':'fuel'})
mpg.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 234 entries, 1 to 234
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   manufacturer  234 non-null    object
 1   model         234 non-null    object
 2   displacement  234 non-null    float64
 3   year          234 non-null    int64
 4   cylinders     234 non-null    int64
 5   trans         234 non-null    object
 6   drive         234 non-null    object
 7   city          234 non-null    int64
 8   highway       234 non-null    int64
 9   fuel          234 non-null    object
 10  class         234 non-null    object
dtypes: float64(1), int64(4), object(6)
memory usage: 21.9+ KB

In [48]:
# 9. Display the summary statistics for the dataset.

In [49]:
mpg.describe()

       displacement         year   cylinders        city     highway
count    234.000000   234.000000  234.000000  234.000000  234.000000
mean       3.471795  2003.500000    5.888889   16.858974   23.440171
std        1.291959     4.509646    1.611534    4.255946    5.954643
min        1.600000  1999.000000    4.000000    9.000000   12.000000
25%        2.400000  1999.000000    4.000000   14.000000   18.000000
50%        3.300000  2003.500000    6.000000   17.000000   24.000000
75%        4.600000  2008.000000    8.000000   19.000000   27.000000
max        7.000000  2008.000000    8.000000   35.000000   44.000000

In [50]:
# How many different manufacturers are there?

In [51]:
mpg['manufacturer'].value_counts()

dodge         37
toyota        34
volkswagen    27
ford          25
chevrolet     19
audi          18
hyundai       14
subaru        14
nissan        13
honda          9
jeep           8
pontiac        5
land rover     4
mercury        4
lincoln        3
Name: manufacturer, dtype: int64

In [52]:
# How many different models are there?

In [53]:
mpg['model'].nunique()

38

In [54]:
# Create a column named mileage_difference like you did in the DataFrames exercises; 
# this column should contain the difference between highway 
# and city mileage for each car.

In [55]:
mpg['mileage_difference'] = mpg['highway'] -mpg['city']
mpg.head()

,manufacturer,model,displacement,year,cylinders,trans,drive,city,highway,fuel,class,mileage_difference
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10

In [56]:
# Create a column named average_mileage like you did in the DataFrames exercises; 
# this is the mean of the city and highway mileage.

In [57]:
mpg['average_mileage']= (mpg['highway'] + mpg['city'])/2
mpg.head()

,manufacturer,model,displacement,year,cylinders,trans,drive,city,highway,fuel,class,mileage_difference,average_mileage
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11,23.5
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8,25.0
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11,25.5
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9,25.5
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10,21.0

In [58]:
# Create a new column on the mpg dataset named is_automatic 
# that holds boolean values denoting whether the car has an automatic transmission.

In [59]:
mpg['trans'].value_counts()
mpg['is_automatic'] = mpg.trans.str.contains('auto')
mpg.head

<bound method NDFrame.head of     manufacturer   model  displacement  year  cylinders       trans drive  \
1           audi      a4           1.8  1999          4    auto(l5)     f
2           audi      a4           1.8  1999          4  manual(m5)     f
3           audi      a4           2.0  2008          4  manual(m6)     f
4           audi      a4           2.0  2008          4    auto(av)     f
5           audi      a4           2.8  1999          6    auto(l5)     f
..           ...     ...           ...   ...        ...         ...   ...
230   volkswagen  passat           2.0  2008          4    auto(s6)     f
231   volkswagen  passat           2.0  2008          4  manual(m6)     f
232   volkswagen  passat           2.8  1999          6    auto(l5)     f
233   volkswagen  passat           2.8  1999          6  manual(m5)     f
234   volkswagen  passat           3.6  2008          6    auto(s6)     f

     city  highway fuel    class  mileage_difference  average_mileage  \
1      18       29    p  compact                  11             23.5
2      21       29    p  compact                   8             25.0
3      20       31    p  compact                  11             25.5
4      21       30    p  compact                   9             25.5
5      16       26    p  compact                  10             21.0
..    ...      ...  ...      ...                 ...              ...
230    19       28    p  midsize                   9             23.5
231    21       29    p  midsize                   8             25.0
232    16       26    p  midsize                  10             21.0
233    18       26    p  midsize                   8             22.0
234    17       26    p  midsize                   9             21.5

     is_automatic
1            True
2           False
3           False
4            True
5            True
..            ...
230          True
231         False
232          True
233         False
234          True

[234 rows x 14 columns]>

In [60]:
# Using the mpg dataset, 
# find out which which manufacturer has 
# the best miles per gallon on average?

In [61]:
mpg.groupby('manufacturer').average_mileage.mean().sort_values(ascending = False).head(1)

manufacturer
honda    28.5
Name: average_mileage, dtype: float64

In [62]:
# Do automatic or manual cars have better miles per gallon?

In [63]:
best_car = mpg.groupby('is_automatic').average_mileage.agg(['mean'])
best_car

                   mean
is_automatic
False         22.227273
True          19.130573

In [64]:
# PART 3 EXERCISES

In [65]:
# 1. Use your get_db_url function to help you explore the data from the chipotle database.

In [79]:
def get_db_url(database):
    return f'mysql+pymysql://{user}:{password}@{host}/{database}'

In [85]:
chipotle = pd.read_sql(chipotle_query, get_db_url('chipotle'))

NameError: name 'user' is not defined

In [83]:
chipotle_df.sample(5)

NameError: name 'chipotle_df' is not defined

In [ ]:
chipotle_df.info()

In [ ]:
# 2. What is the total price for each order?

In [ ]:
chipotle_df['item_price'] = chipotle_df.item_price.str.replace('$', '').astype(float)

In [ ]:
order_totals = chipotle_df.groupby('order_id').item_price.agg(['sum'])
order_totals.sample(5)

In [ ]:
# 3. What are the most popular 3 items?

In [ ]:
top_three = chipotle_df.groupby('item_name').quantity.sum().sort_values(ascending = False).head(3)
top_three

In [ ]:
# 4. Which item has produced the most revenue?

In [ ]:
most_rev = chipotle_df.groupby('item_name').item_price.sum().sort_values(ascending = False).head(1)
most_rev

In [ ]:
# 5. Join the employees and titles DataFrames together.

In [ ]:
titles_query = '''
SELECT * FROM titles
'''
titles_df = pd.read_sql(titles_query, get_db_url('employees'))

In [ ]:
employees_query = '''
SELECT * FROM employees
'''
employees_df = pd.read_sql(employees_query, get_db_url('employees'))
employees_df.info()

In [ ]:
new_df = titles_df.merge(employees_df, left_on='emp_no', right_on='emp_no', indicator=True)
new_df.head()

In [ ]:
new_df.info()

In [ ]:
# 6. For each title, find the hire date of the employee that was hired most recently with that title.

In [ ]:
new_df.groupby('title').from_date.max()

In [ ]:
# 7. Write the code necessary to create a cross tabulation of the number of titles by department.

In [ ]:
dept_title = '''
                    SELECT t.emp_no,
                    t.title, 
                    t.from_date, 
                    t.to_date, 
                    d.dept_name 
                    FROM departments AS d 
                    JOIN dept_emp AS de USING(dept_no) 
                    JOIN titles AS t USING(emp_no);
                    '''

In [ ]:
dept_titles = pd.read_sql(dept_title, get_db_url('employees'))
dept_titles.head()

In [ ]:
all_titles_crosstab = pd.crosstab(
    dept_titles.dept_name, dept_titles.title)

In [ ]:
all_titles_crosstab

In [ ]:
current_titles = dept_titles[dept_titles.to_date == dept_titles.to_date.max()]
current_titles.head()

In [ ]:
current_titles_crosstab = pd.crosstab(current_titles.dept_name, current_titles.title)
current_titles_crosstab